app/Http/Controllers/Auth/RegisterController.php

    protected function create(array $data)
    {
        return User::create([
            'name' => $data['name'],
            'email' => $data['email'],
            'password' => Hash::make($data['password']),
        ]);
---
insert into `users` (`role_id`, `name`, `username`, `email`, `password`, `updated_at`, `created_at`) values (2, 'JastinTermos', 'jastin', 'Jastin@mail.ru', '$2y$10$ohw4KTZgKG8.qRmHrxjSfui5O6A4bfQzuEMv8lXMFWcH7RT7/Lhei', '2022-12-08 15:48:20', '2022-12-08 15:48:20')